JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1062/port_flexspi_info.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "mtu.h"
#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "clock_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/////////////////////////////////////////////////////////////
enum _flexspi1_data_line_sel
{
    kFlexspi1_DataA_GPIO_SD_B1_11_08   = 0x00,
    kFlexspi1_DataA_GPIO_AD_B1_13_10   = 0x01,

    kFlexspi1_DataB_GPIO_SD_B1_03_00   = 0x10,
    kFlexspi1_DataB_GPIO_AD_B1_07_04   = 0x11,
};

enum _flexspi1_ss_b_sel
{
    kFlexspi1_Ss0A_GPIO_SD_B1_06   = 0x00,
    kFlexspi1_Ss0A_GPIO_AD_B1_15   = 0x01,
    kFlexspi1_Ss1A_GPIO_SD_B0_00   = 0x02,
    kFlexspi1_Ss1A_GPIO_SD_B1_04   = 0x03,
    kFlexspi1_Ss1A_GPIO_AD_B1_08   = 0x04,

    kFlexspi1_Ss0B_GPIO_SD_B0_04   = 0x10,
    kFlexspi1_Ss0B_GPIO_SD_B1_05   = 0x11,
    kFlexspi1_Ss1B_GPIO_SD_B0_01   = 0x12,
};

enum _flexspi1_sclk_sel
{
    kFlexspi1_SclkA_GPIO_SD_B1_07  = 0x00,
    kFlexspi1_SclkA_GPIO_AD_B1_14  = 0x01,

    kFlexspi1_SclkB_GPIO_SD_B1_04  = 0x10,
};

enum _flexspi1_dqs_sel
{
    kFlexspi1_DqsA_GPIO_SD_B1_05   = 0x00,
    kFlexspi1_DqsA_GPIO_AD_B1_09   = 0x01,

    kFlexspi1_DqsB_GPIO_SD_B0_05   = 0x10,
};

enum _flexspi1_rst_b_sel
{
    kFlexspi1_Rst_GPIO_AD_B0_09    = 0x00,
};

/////////////////////////////////////////////////////////////
enum _flexspi2_data_line_sel
{
    kFlexspi2_DataA_GPIO_EMC_29_26                = 0x00,
    kFlexspi2_DataA_GPIO_SPI_B1_04_01             = 0x01,
    kFlexspi2_DataA_GPIO_SPI_B0_12_10_06_02       = 0x02,

    kFlexspi2_DataB_GPIO_EMC_16_13                = 0x10,
    kFlexspi2_DataB_GPIO_SPI_B0_11_07_04_03       = 0x11,
};

enum _flexspi2_ss_b_sel
{
    kFlexspi2_Ss0A_GPIO_EMC_24       = 0x00,
    kFlexspi2_Ss0A_GPIO_SPI_B1_06    = 0x01,
    kFlexspi2_Ss0A_GPIO_SPI_B0_05    = 0x02,
    kFlexspi2_Ss1A_GPIO_EMC_22       = 0x03,

    kFlexspi2_Ss0B_GPIO_EMC_10       = 0x10,
    kFlexspi2_Ss1B_GPIO_EMC_09       = 0x11,
};

enum _flexspi2_sclk_sel
{
    kFlexspi2_SclkA_GPIO_EMC_25      = 0x00,
    kFlexspi2_SclkA_GPIO_SPI_B1_05   = 0x01,
    kFlexspi2_SclkA_GPIO_SPI_B0_08   = 0x02,

    kFlexspi2_SclkB_GPIO_EMC_12      = 0x10,
    kFlexspi2_SclkB_GPIO_SPI_B0_01   = 0x11,
};

enum _flexspi2_dqs_sel
{
    kFlexspi2_DqsA_GPIO_EMC_23      = 0x00,
    kFlexspi2_DqsA_GPIO_SPI_B1_00   = 0x01,
    kFlexspi2_DqsA_GPIO_SPI_B0_09   = 0x02,

    kFlexspi2_DqsB_GPIO_EMC_11      = 0x10,
};

#define MTU_USE_FSPI1_PORTA1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI;        \
        s_userConfig.mixspiPort = kFLEXSPI_PortA1;\
    }
#define MTU_USE_FSPI1_PORTA2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI;        \
        s_userConfig.mixspiPort = kFLEXSPI_PortA2;\
    }
#define MTU_USE_FSPI1_PORTB1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI;        \
        s_userConfig.mixspiPort = kFLEXSPI_PortB1;\
    }
#define MTU_USE_FSPI1_PORTB2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI;        \
        s_userConfig.mixspiPort = kFLEXSPI_PortB2;\
    }
#define MTU_USE_FSPI2_PORTA1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA1;\
    }
#define MTU_USE_FSPI2_PORTA2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA2;\
    }
#define MTU_USE_FSPI2_PORTB1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB1;\
    }
#define MTU_USE_FSPI2_PORTB2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB2;\
    }


/*******************************************************************************
 * Prototypes
 ******************************************************************************/

   
/*******************************************************************************
 * Variables
 ******************************************************************************/

pin_info_t s_pinInfo[MTU_MAX_PINS];


/*******************************************************************************
 * Code
 ******************************************************************************/

void bsp_mixspi_pinmux_config(void *configPacket, bool isPintest)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);
    if (isPintest)
    {
        pin_unittest_packet_t *packet = (pin_unittest_packet_t *)configPacket;
        gpio_pin_config_t do_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
        memset(s_pinInfo, 0xFF, sizeof(s_pinInfo));
        ///////////////////////////////////////////////////////////////
        // Pin test INST=1
        if (packet->memConnection.instance == 1)
        {
            if (packet->pintestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi1_DataA_GPIO_SD_B1_11_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_11_GPIO3_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_10_GPIO3_IO10, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_09_GPIO3_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_08_GPIO3_IO08, 0U);
                        GPIO_PinInit(GPIO3, 11, &do_config);
                        GPIO_PinInit(GPIO3, 10, &do_config);
                        GPIO_PinInit(GPIO3, 9, &do_config);
                        GPIO_PinInit(GPIO3, 8, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 11;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 10;
                        s_pinInfo[2].gpioGroup = 3;
                        s_pinInfo[2].gpioPin = 9;
                        s_pinInfo[3].gpioGroup = 3;
                        s_pinInfo[3].gpioPin = 8;
                        break;
                    case kFlexspi1_DataA_GPIO_AD_B1_13_10:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_13_GPIO1_IO29, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_12_GPIO1_IO28, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U);
                        GPIO_PinInit(GPIO1, 29, &do_config);
                        GPIO_PinInit(GPIO1, 28, &do_config);
                        GPIO_PinInit(GPIO1, 27, &do_config);
                        GPIO_PinInit(GPIO1, 26, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 29;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 28;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 27;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 26;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B1_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_GPIO3_IO03, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO3_IO02, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_GPIO3_IO01, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_GPIO3_IO00, 0U);
                        GPIO_PinInit(GPIO3, 3, &do_config);
                        GPIO_PinInit(GPIO3, 2, &do_config);
                        GPIO_PinInit(GPIO3, 1, &do_config);
                        GPIO_PinInit(GPIO3, 0, &do_config);
                        s_pinInfo[0].gpioGroup = 3;
                        s_pinInfo[0].gpioPin = 3;
                        s_pinInfo[1].gpioGroup = 3;
                        s_pinInfo[1].gpioPin = 2;
                        s_pinInfo[2].gpioGroup = 3;
                        s_pinInfo[2].gpioPin = 1;
                        s_pinInfo[3].gpioGroup = 3;
                        s_pinInfo[3].gpioPin = 0;
                        break;
                    case kFlexspi1_DataB_GPIO_AD_B1_07_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U);
                        GPIO_PinInit(GPIO1, 23, &do_config);
                        GPIO_PinInit(GPIO1, 22, &do_config);
                        GPIO_PinInit(GPIO1, 21, &do_config);
                        GPIO_PinInit(GPIO1, 20, &do_config);
                        s_pinInfo[0].gpioGroup = 1;
                        s_pinInfo[0].gpioPin = 23;
                        s_pinInfo[1].gpioGroup = 1;
                        s_pinInfo[1].gpioPin = 22;
                        s_pinInfo[2].gpioGroup = 1;
                        s_pinInfo[2].gpioPin = 21;
                        s_pinInfo[3].gpioGroup = 1;
                        s_pinInfo[3].gpioPin = 20;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi1_Ss0A_GPIO_SD_B1_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_06_GPIO3_IO06, 0U);
                        GPIO_PinInit(GPIO3, 6, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 6;
                        break;
                    case kFlexspi1_Ss0A_GPIO_AD_B1_15:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_15_GPIO1_IO31, 0U);
                        GPIO_PinInit(GPIO1, 31, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 31;
                        break;
                    case kFlexspi1_Ss1A_GPIO_SD_B0_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_GPIO3_IO12, 0U);
                        GPIO_PinInit(GPIO3, 12, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 12;
                        break;
                    case kFlexspi1_Ss1A_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U);
                        GPIO_PinInit(GPIO3, 4, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 4;
                        break;
                    case kFlexspi1_Ss1A_GPIO_AD_B1_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_08_GPIO1_IO24, 0U);
                        GPIO_PinInit(GPIO1, 24, &do_config);
                        s_pinInfo[4].gpioGroup = 1;
                        s_pinInfo[4].gpioPin = 24;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B0_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_04_GPIO3_IO16, 0U);
                        GPIO_PinInit(GPIO3, 16, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 16;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO3_IO05, 0U);
                        GPIO_PinInit(GPIO3, 5, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 5;
                        break;
                    case kFlexspi1_Ss1B_GPIO_SD_B0_01:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_GPIO3_IO13, 0U);
                        GPIO_PinInit(GPIO3, 13, &do_config);
                        s_pinInfo[4].gpioGroup = 3;
                        s_pinInfo[4].gpioPin = 13;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi1_SclkA_GPIO_SD_B1_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_07_GPIO3_IO07, 0U);
                        GPIO_PinInit(GPIO3, 7, &do_config);
                        s_pinInfo[5].gpioGroup = 3;
                        s_pinInfo[5].gpioPin = 7;
                        break;
                    case kFlexspi1_SclkA_GPIO_AD_B1_14:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_14_GPIO1_IO30, 0U);
                        GPIO_PinInit(GPIO1, 30, &do_config);
                        s_pinInfo[5].gpioGroup = 1;
                        s_pinInfo[5].gpioPin = 30;
                        break;
                    case kFlexspi1_SclkB_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U);
                        GPIO_PinInit(GPIO3, 4, &do_config);
                        s_pinInfo[5].gpioGroup = 3;
                        s_pinInfo[5].gpioPin = 4;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi1_DqsA_GPIO_SD_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO3_IO05, 0U);
                        GPIO_PinInit(GPIO3, 5, &do_config);
                        s_pinInfo[6].gpioGroup = 3;
                        s_pinInfo[6].gpioPin = 5;
                        break;
                    case kFlexspi1_DqsA_GPIO_AD_B1_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_09_GPIO1_IO25, 0U);
                        GPIO_PinInit(GPIO1, 25, &do_config);
                        s_pinInfo[6].gpioGroup = 1;
                        s_pinInfo[6].gpioPin = 25;
                        break;
                    case kFlexspi1_DqsB_GPIO_SD_B0_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_GPIO3_IO17, 0U);
                        GPIO_PinInit(GPIO3, 17, &do_config);
                        s_pinInfo[6].gpioGroup = 3;
                        s_pinInfo[6].gpioPin = 17;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi1_DataB_GPIO_SD_B1_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_GPIO3_IO03, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO3_IO02, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_01_GPIO3_IO01, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_00_GPIO3_IO00, 0U);
                        GPIO_PinInit(GPIO3, 3, &do_config);
                        GPIO_PinInit(GPIO3, 2, &do_config);
                        GPIO_PinInit(GPIO3, 1, &do_config);
                        GPIO_PinInit(GPIO3, 0, &do_config);
                        s_pinInfo[7].gpioGroup = 3;
                        s_pinInfo[7].gpioPin = 3;
                        s_pinInfo[8].gpioGroup = 3;
                        s_pinInfo[8].gpioPin = 2;
                        s_pinInfo[9].gpioGroup = 3;
                        s_pinInfo[9].gpioPin = 1;
                        s_pinInfo[10].gpioGroup = 3;
                        s_pinInfo[10].gpioPin = 0;
                        break;
                    case kFlexspi1_DataB_GPIO_AD_B1_07_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U);
                        GPIO_PinInit(GPIO1, 23, &do_config);
                        GPIO_PinInit(GPIO1, 22, &do_config);
                        GPIO_PinInit(GPIO1, 21, &do_config);
                        GPIO_PinInit(GPIO1, 20, &do_config);
                        s_pinInfo[7].gpioGroup = 1;
                        s_pinInfo[7].gpioPin = 23;
                        s_pinInfo[8].gpioGroup = 1;
                        s_pinInfo[8].gpioPin = 22;
                        s_pinInfo[9].gpioGroup = 1;
                        s_pinInfo[9].gpioPin = 21;
                        s_pinInfo[10].gpioGroup = 1;
                        s_pinInfo[10].gpioPin = 20;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataTop8bit)
            {
            }
            if (packet->pintestEn.option.B.sclk_n)
            {
                switch (packet->memConnection.sclk_n)
                {
                    case kFlexspi1_SclkB_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO3_IO04, 0U);
                        GPIO_PinInit(GPIO3, 4, &do_config);
                        s_pinInfo[19].gpioGroup = 3;
                        s_pinInfo[19].gpioPin = 4;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs1)
            {
                switch (packet->memConnection.dqs1)
                {
                    case kFlexspi1_DqsB_GPIO_SD_B0_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_GPIO3_IO17, 0U);
                        GPIO_PinInit(GPIO3, 17, &do_config);
                        s_pinInfo[20].gpioGroup = 3;
                        s_pinInfo[20].gpioPin = 17;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.rst_b)
            {
                switch (packet->memConnection.rst_b)
                {
                    case kFlexspi1_Rst_GPIO_AD_B0_09:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0U);
                        //IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0x10B0U); 
                        GPIO_PinInit(GPIO1, 9, &do_config);
                        s_pinInfo[21].gpioGroup = 1;
                        s_pinInfo[21].gpioPin = 9;
                        break;
                    default:
                        break;
                }
            }
        }
        ///////////////////////////////////////////////////////////////
        // Pin test INST=2
        else if (packet->memConnection.instance == 2)
        {
            if (packet->pintestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi2_DataA_GPIO_EMC_29_26:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_GPIO4_IO29, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_28_GPIO4_IO28, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_27_GPIO4_IO27, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_GPIO4_IO26, 0U);
                        GPIO_PinInit(GPIO4, 29, &do_config);
                        GPIO_PinInit(GPIO4, 28, &do_config);
                        GPIO_PinInit(GPIO4, 27, &do_config);
                        GPIO_PinInit(GPIO4, 26, &do_config);
                        s_pinInfo[0].gpioGroup = 4;
                        s_pinInfo[0].gpioPin = 29;
                        s_pinInfo[1].gpioGroup = 4;
                        s_pinInfo[1].gpioPin = 28;
                        s_pinInfo[2].gpioGroup = 4;
                        s_pinInfo[2].gpioPin = 27;
                        s_pinInfo[3].gpioGroup = 4;
                        s_pinInfo[3].gpioPin = 26;
                        break;
                    case kFlexspi2_DataA_GPIO_SPI_B1_04_01:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_04_GPIO10_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_03_GPIO10_IO17, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_02_GPIO10_IO16, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_01_GPIO10_IO15, 0U);
                        GPIO_PinInit(GPIO10, 18, &do_config);
                        GPIO_PinInit(GPIO10, 17, &do_config);
                        GPIO_PinInit(GPIO10, 16, &do_config);
                        GPIO_PinInit(GPIO10, 15, &do_config);
                        s_pinInfo[0].gpioGroup = 10;
                        s_pinInfo[0].gpioPin = 18;
                        s_pinInfo[1].gpioGroup = 10;
                        s_pinInfo[1].gpioPin = 17;
                        s_pinInfo[2].gpioGroup = 10;
                        s_pinInfo[2].gpioPin = 16;
                        s_pinInfo[3].gpioGroup = 10;
                        s_pinInfo[3].gpioPin = 15;
                        break;
                    case kFlexspi2_DataA_GPIO_SPI_B0_12_10_06_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_12_GPIO10_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_10_GPIO10_IO10, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_06_GPIO10_IO06, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_02_GPIO10_IO02, 0U);
                        GPIO_PinInit(GPIO10, 12, &do_config);
                        GPIO_PinInit(GPIO10, 10, &do_config);
                        GPIO_PinInit(GPIO10, 6, &do_config);
                        GPIO_PinInit(GPIO10, 2, &do_config);
                        s_pinInfo[0].gpioGroup = 10;
                        s_pinInfo[0].gpioPin = 12;
                        s_pinInfo[1].gpioGroup = 10;
                        s_pinInfo[1].gpioPin = 10;
                        s_pinInfo[2].gpioGroup = 10;
                        s_pinInfo[2].gpioPin = 6;
                        s_pinInfo[3].gpioGroup = 10;
                        s_pinInfo[3].gpioPin = 2;
                        break;
                    case kFlexspi2_DataB_GPIO_EMC_16_13:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_16_GPIO4_IO16, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_15_GPIO4_IO15, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_14_GPIO4_IO14, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_GPIO4_IO13, 0U);
                        GPIO_PinInit(GPIO4, 16, &do_config);
                        GPIO_PinInit(GPIO4, 15, &do_config);
                        GPIO_PinInit(GPIO4, 14, &do_config);
                        GPIO_PinInit(GPIO4, 13, &do_config);
                        s_pinInfo[0].gpioGroup = 4;
                        s_pinInfo[0].gpioPin = 16;
                        s_pinInfo[1].gpioGroup = 4;
                        s_pinInfo[1].gpioPin = 15;
                        s_pinInfo[2].gpioGroup = 4;
                        s_pinInfo[2].gpioPin = 14;
                        s_pinInfo[3].gpioGroup = 4;
                        s_pinInfo[3].gpioPin = 13;
                        break;
                    case kFlexspi2_DataB_GPIO_SPI_B0_11_07_04_03:
