JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1062/port_flexspi_info.c
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_05_FLEXSPIB_DQS, packet->padCtrl.dqs1);
                    }
                    break;
                default:
                    break;
            }
        }
        ///////////////////////////////////////////////////////////////
        // Peri cfg INST=2
        else if (packet->memConnection.instance == 2)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi2_DataA_GPIO_EMC_29_26:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_FLEXSPI2_A_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_28_FLEXSPI2_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_27_FLEXSPI2_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_FLEXSPI2_A_DATA00, 1U);
                    if (packet->padCtrl.dataLow4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_29_FLEXSPI2_A_DATA03, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_28_FLEXSPI2_A_DATA02, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_27_FLEXSPI2_A_DATA01, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_26_FLEXSPI2_A_DATA00, packet->padCtrl.dataLow4bit);
                    }
                    break;
                case kFlexspi2_DataA_GPIO_SPI_B1_04_01:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_04_FLEXSPI2_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_03_FLEXSPI2_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_02_FLEXSPI2_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_01_FLEXSPI2_A_DATA03, 1U);
                    if (packet->padCtrl.dataLow4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_04_FLEXSPI2_A_DATA00, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_03_FLEXSPI2_A_DATA01, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_02_FLEXSPI2_A_DATA02, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_01_FLEXSPI2_A_DATA03, packet->padCtrl.dataLow4bit);
                    }
                    break;
                case kFlexspi2_DataA_GPIO_SPI_B0_12_10_06_02:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_02_FLEXSPI2_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_12_FLEXSPI2_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_06_FLEXSPI2_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_10_FLEXSPI2_A_DATA03, 1U);
                    if (packet->padCtrl.dataLow4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_02_FLEXSPI2_A_DATA00, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_12_FLEXSPI2_A_DATA01, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_06_FLEXSPI2_A_DATA02, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_10_FLEXSPI2_A_DATA03, packet->padCtrl.dataLow4bit);
                    }
                    break;
                case kFlexspi2_DataB_GPIO_EMC_16_13:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00, 1U);
                    if (packet->padCtrl.dataLow4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00, packet->padCtrl.dataLow4bit);
                    }
                    break;
                case kFlexspi2_DataB_GPIO_SPI_B0_11_07_04_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_11_FLEXSPI2_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_07_FLEXSPI2_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_03_FLEXSPI2_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_04_FLEXSPI2_B_DATA03, 1U);
                    if (packet->padCtrl.dataLow4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_11_FLEXSPI2_B_DATA00, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_07_FLEXSPI2_B_DATA01, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_03_FLEXSPI2_B_DATA02, packet->padCtrl.dataLow4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_04_FLEXSPI2_B_DATA03, packet->padCtrl.dataLow4bit);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.ss_b)
            {
                case kFlexspi2_Ss0A_GPIO_EMC_24:
                    MTU_USE_FSPI2_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_FLEXSPI2_A_SS0_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_24_FLEXSPI2_A_SS0_B, packet->padCtrl.ss_b);
                    }
                    break;
                case kFlexspi2_Ss0A_GPIO_SPI_B1_06:
                    MTU_USE_FSPI2_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_06_FLEXSPI2_A_SS0_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_06_FLEXSPI2_A_SS0_B, packet->padCtrl.ss_b);
                    }
                    break;
                case kFlexspi2_Ss0A_GPIO_SPI_B0_05:
                    MTU_USE_FSPI2_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_05_FLEXSPI2_A_SS0_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_05_FLEXSPI2_A_SS0_B, packet->padCtrl.ss_b);
                    }
                    break;
                case kFlexspi2_Ss1A_GPIO_EMC_22:
                    MTU_USE_FSPI2_PORTA2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_22_FLEXSPI2_A_SS1_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_22_FLEXSPI2_A_SS1_B, packet->padCtrl.ss_b);
                    }
                    break;
                case kFlexspi2_Ss0B_GPIO_EMC_10:
                    MTU_USE_FSPI2_PORTB1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_10_FLEXSPI2_B_SS0_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_10_FLEXSPI2_B_SS0_B, packet->padCtrl.ss_b);
                    }
                    break;
                case kFlexspi2_Ss1B_GPIO_EMC_09:
                    MTU_USE_FSPI2_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_09_FLEXSPI2_B_SS1_B, 1U);
                    if (packet->padCtrl.ss_b != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_09_FLEXSPI2_B_SS1_B, packet->padCtrl.ss_b);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi2_SclkA_GPIO_EMC_25:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_FLEXSPI2_A_SCLK, 1U);
                    if (packet->padCtrl.sclk != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_25_FLEXSPI2_A_SCLK, packet->padCtrl.sclk);
                    }
                    break;
                case kFlexspi2_SclkA_GPIO_SPI_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_05_FLEXSPI2_A_SCLK, 1U);
                    if (packet->padCtrl.sclk != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_05_FLEXSPI2_A_SCLK, packet->padCtrl.sclk);
                    }
                    break;
                case kFlexspi2_SclkA_GPIO_SPI_B0_08:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_08_FLEXSPI2_A_SCLK, 1U);
                    if (packet->padCtrl.sclk != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_08_FLEXSPI2_A_SCLK, packet->padCtrl.sclk);
                    }
                    break;
                case kFlexspi2_SclkB_GPIO_EMC_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK, 1U);
                    if (packet->padCtrl.sclk != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK, packet->padCtrl.sclk);
                    }
                    break;
                case kFlexspi2_SclkB_GPIO_SPI_B0_01:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_01_FLEXSPI2_B_SCLK, 1U);
                    if (packet->padCtrl.sclk != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_01_FLEXSPI2_B_SCLK, packet->padCtrl.sclk);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi2_DqsA_GPIO_EMC_23:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_FLEXSPI2_A_DQS, 1U);
                    if (packet->padCtrl.dqs0 != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_23_FLEXSPI2_A_DQS, packet->padCtrl.dqs0);
                    }
                    break;
                case kFlexspi2_DqsA_GPIO_SPI_B1_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B1_00_FLEXSPI2_A_DQS, 1U);
                    if (packet->padCtrl.dqs0 != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B1_00_FLEXSPI2_A_DQS, packet->padCtrl.dqs0);
                    }
                    break;
                case kFlexspi2_DqsA_GPIO_SPI_B0_09:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_09_FLEXSPI2_A_DQS, 1U);
                    if (packet->padCtrl.dqs0 != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_09_FLEXSPI2_A_DQS, packet->padCtrl.dqs0);
                    }
                    break;
                case kFlexspi2_DqsB_GPIO_EMC_11:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_11_FLEXSPI2_B_DQS, 1U);
                    if (packet->padCtrl.dqs0 != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_11_FLEXSPI2_B_DQS, packet->padCtrl.dqs0);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi2_DataB_GPIO_EMC_16_13:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00, 1U);
                    if (packet->padCtrl.dataHigh4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00, packet->padCtrl.dataHigh4bit);
                    }
                    break;
                case kFlexspi2_DataB_GPIO_SPI_B0_11_07_04_03:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_11_FLEXSPI2_B_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_07_FLEXSPI2_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_03_FLEXSPI2_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_04_FLEXSPI2_B_DATA03, 1U);
                    if (packet->padCtrl.dataHigh4bit != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_11_FLEXSPI2_B_DATA00, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_07_FLEXSPI2_B_DATA01, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_03_FLEXSPI2_B_DATA02, packet->padCtrl.dataHigh4bit);
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_04_FLEXSPI2_B_DATA03, packet->padCtrl.dataHigh4bit);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi2_SclkB_GPIO_EMC_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK, 1U);
                    if (packet->padCtrl.sclk_n != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK, packet->padCtrl.sclk_n);
                    }
                    break;
                case kFlexspi2_SclkB_GPIO_SPI_B0_01:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SPI_B0_01_FLEXSPI2_B_SCLK, 1U);
                    if (packet->padCtrl.sclk_n != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_SPI_B0_01_FLEXSPI2_B_SCLK, packet->padCtrl.sclk_n);
                    }
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi2_DqsB_GPIO_EMC_11:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_11_FLEXSPI2_B_DQS, 1U);
                    if (packet->padCtrl.dqs1 != DEFAULT_PAD_CTRL_MAGIC)
                    {
                        IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_11_FLEXSPI2_B_DQS, packet->padCtrl.dqs1);
                    }
                    break;
                default:
                    break;
            }
        }
    }
}

void bsp_mixspi_gpios_toggle(void)
{
    if (s_pinUnittestPacket.pintestEn.enableAdcSample)
    {
        uint8_t convValue = bsp_adc_get_conv_value();
        mtu_uart_sendhex(&convValue, sizeof(convValue));
    }
  
    GPIO_Type *gpioBase[] = GPIO_BASE_PTRS;
    for (uint32_t i = 0; i < sizeof(s_pinInfo) / sizeof(pin_info_t); i++)
    {
        if (s_pinInfo[i].gpioGroup != 0xFFFFu)
        {
            GPIO_PortToggle(gpioBase[s_pinInfo[i].gpioGroup], 1u << s_pinInfo[i].gpioPin);
        }
    }
}

